---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotUpdateWallPanel
source: html/7578367a-679c-3c5f-a96d-210eb9e92b00.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotUpdateWallPanel Property

Unable to update wall panel.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUpdateWallPanel { get; }
```